# =============================================================================
# Brewfile — Homebrew Bundle
# 用法: brew bundle install --file=Brewfile
# 自动生成于: 2026-06-16 (brew bundle dump)
# =============================================================================

# --- Taps ---
tap "anomalyco/tap"
tap "asmvik/formulae"
tap "barutsrb/tap"
tap "cyberlesterr/antify"
tap "digitalghost-dev/tap"
tap "felixkratz/formulae"
tap "gechr/tap"
tap "gromgit/fuse"
tap "hmbown/deepseek-tui"
tap "joelekstrom/repo"
tap "k06a/tap"
tap "karinushka/paneru"
tap "laishulu/homebrew"
tap "lihaoyun6/tap"
tap "malpern/tap"
tap "manaflow-ai/cmux"
tap "mdnmdn/asimeow"
tap "narbs/tap"
tap "nikitabobko/tap"
tap "otuerk/sidebar"
tap "steipete/tap"
tap "sunnyyoung/tap"
tap "vitorgalvao/tiny-scripts"
tap "yqrashawn/goku"

# =============================================================================
# 终端 / Shell
# =============================================================================
cask "ghostty"            # GPU 加速终端
cask "kitty"              # GPU 终端模拟器
brew "tmux"               # 终端复用器
brew "starship"           # shell 提示符
brew "zoxide"             # 智能 cd
brew "fzf"                # 模糊搜索
brew "bat"                # cat 替代品
brew "fd"                 # find 替代品
brew "fastfetch"          # 系统信息
brew "chafa"              # 终端图片显示
brew "yazi"               # 终端文件管理器
brew "midnight-commander" # 终端文件管理器
brew "stow"               # dotfiles 管理
brew "jq"                 # JSON 处理器
brew "pandoc"             # 文档转换
brew "tag"                # 标签管理 CLI
brew "switchaudio-osx"    # 音频输出切换

# =============================================================================
# 编辑器 / Git
# =============================================================================
brew "neovide"            # Neovim CLI
cask "neovide-app"        # Neovim GUI
brew "lazygit"            # Git TUI
brew "git"                # Git
brew "lua"                # Lua (Neovim 依赖)

# =============================================================================
# 编程语言 / 运行时
# =============================================================================
brew "node@22"            # Node.js
brew "pnpm"               # 包管理
brew "ruby", link: false  # Ruby
brew "openjdk@17"         # Java
cask "flutter"            # Flutter SDK
brew "mpv"                # 视频播放器 (CLI 库)

# =============================================================================
# macOS 工具
# =============================================================================
cask "nikitabobko/tap/aerospace"  # 平铺窗口管理器
cask "hammerspoon"                # 自动化
cask "karabiner-elements"         # 键盘改键
cask "bettertouchtool"            # 触控板/鼠标增强
cask "mac-mouse-fix"              # 鼠标增强
cask "homerow"                    # 键盘导航
cask "cmux"                       # 窗口布局管理
cask "hazeover"                   # 聚焦窗口
brew "felixkratz/formulae/borders"  # 窗口边框
cask "cleanshot"                  # 截图工具
cask "keyboardcleantool"          # 键盘清洁工具
cask "pearcleaner"                # 应用卸载
cask "blockblock"                 # 安全监控
cask "knockknock"                 # 安全扫描
cask "onyx"                       # 系统维护
cask "tencent-lemon"              # 系统清理
brew "mdnmdn/asimeow/asimeow"     # Time Machine 排除管理

# =============================================================================
# Sketchybar 及依赖
# =============================================================================
brew "felixkratz/formulae/sketchybar"   # 状态栏
brew "malpern/tap/sketchybar-toggle"    # 与原生菜单栏协调显示/隐藏
cask "gechr/tap/whichspace"             # macOS Space 切换（sketchybar 依赖）
brew "laishulu/homebrew/macism"         # 输入法查询
brew "nowplaying-cli"                   # 媒体信息查询
cask "squirrel-app"                     # 鼠须管 (Rime 输入法)

# --- 编译依赖 ---
# xcode-select --install（Xcode Command Line Tools）

# =============================================================================
# 桌面应用
# =============================================================================
cask "obsidian"               # 笔记
cask "typora"                 # Markdown 编辑器
cask "bitwarden"              # 密码管理
cask "iina"                   # 视频播放器
cask "balenaetcher"           # 镜像烧录
cask "downie"                 # 视频下载
cask "daisydisk"              # 磁盘分析
cask "imageoptim"             # 图片压缩
cask "folx"                   # 下载管理器
cask "localsend"              # AirDrop 替代
cask "goodsync"               # 文件同步
cask "nutstore"               # 云存储
cask "qspace-pro"             # Finder 替代
cask "android-studio"         # Android 开发
cask "xnviewmp"               # 图片管理
cask "sf-symbols"             # Apple SF Symbols

# =============================================================================
# 浏览器
# =============================================================================
cask "microsoft-edge"         # Edge 浏览器

# =============================================================================
# 字体
# =============================================================================
cask "font-hack-nerd-font"
cask "font-jetbrains-maple-mono-nf"
cask "font-sarasa-gothic"
cask "font-sketchybar-app-font"
cask "font-sf-mono"
cask "font-sf-pro"

# =============================================================================
# 通讯 / 社交
# =============================================================================
cask "qqmusic"                # QQ 音乐
cask "fliqlo"                 # 翻页时钟屏保

# =============================================================================
# 代理
# =============================================================================
cask "clash-verge-rev"        # Clash 代理客户端

# =============================================================================
# 网络工具
# =============================================================================
brew "wireshark"              # 抓包
brew "smartmontools"          # 磁盘监控
brew "telnet"                 # Telnet
brew "transmission-cli"       # BT 客户端 (CLI)
brew "mole"                   # 隧道代理
brew "ifstat"                 # 网络接口带宽监控
brew "gromgit/fuse/archivemount-mac" # 归档挂载

# =============================================================================
# 系统监控 / 菜单栏
# =============================================================================
cask "istat-menus"            # 系统监控
cask "soundsource"            # 音频管理
cask "lunarbar"               # 菜单栏整理
brew "btop"                   # 终端系统监控

# =============================================================================
# 媒体 / 图像
# =============================================================================
brew "ffmpeg"                 # 音视频处理
brew "ffmpegthumbnailer"      # 视频缩略图
brew "media-info"             # 媒体信息查询
brew "vips"                   # 图像处理库
brew "timg"                   # 终端图片/视频查看
brew "imagemagick"            # 图像处理
brew "imagemagick-full"       # 图像处理 (完整版)
brew "unar"                   # 解压缩工具

# =============================================================================
# 游戏
# =============================================================================
brew "nethack"
brew "bastet"
brew "vitetris"
brew "nudoku"
brew "nyancat"
brew "tty-clock"
brew "cmatrix"
brew "cbonsai"
brew "asciiquarium"
brew "joelekstrom/repo/terminal-mines"
cask "shattered-pixel-dungeon"
brew "fortune"

# =============================================================================
# 开发工具
# =============================================================================
brew "anomalyco/tap/opencode"   # AI 编程助手
brew "hmbown/deepseek-tui/deepseek-tui"  # DeepSeek TUI
cask "codex"                    # OpenAI 编程代理
cask "kiro-cli"                 # AI CLI 工具
brew "cc-switch-cli"            # AI 助手切换
brew "docker"                   # Docker CLI
brew "sevenzip"                 # 压缩工具
brew "clippy"                   # 剪贴板管理 CLI
brew "cask"                     # Homebrew Cask CLI
brew "rich-cli"                 # 终端美化输出

# =============================================================================
# npm 全局包
# =============================================================================
npm "corepack"
npm "reasonix"

# =============================================================================
# Cargo
# =============================================================================
cargo "pokeget"
