tap "anomalyco/tap", trusted: true
tap "asmvik/formulae", trusted: true
tap "barutsrb/tap", "https://github.com/BarutSRB/homebrew-tap", trusted: true
tap "cyberlesterr/antify", "https://github.com/cyberlesterr/homebrew-antify.git", trusted: true
tap "digitalghost-dev/tap", trusted: true
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae", trusted: true
tap "gechr/tap"
tap "gromgit/fuse", trusted: true
tap "hmbown/deepseek-tui", "https://github.com/Hmbown/homebrew-deepseek-tui", trusted: true
tap "joelekstrom/repo", trusted: true
tap "k06a/tap", trusted: true
tap "laishulu/homebrew", trusted: true
tap "lihaoyun6/tap", trusted: true
tap "malpern/tap", trusted: true
tap "mdnmdn/asimeow"
tap "narbs/tap", trusted: true
tap "nikitabobko/tap", trusted: true
tap "otuerk/sidebar", trusted: true
tap "steipete/tap", trusted: true
tap "vitorgalvao/tiny-scripts", trusted: true
tap "yqrashawn/goku", trusted: true
# Download with resuming and segmented downloading
brew "aria2"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Bastard Tetris
brew "bastet"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Emacs dependency management
brew "cask"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# All-in-one assistant tool for Claude Code, Codex, Gemini, OpenCode and OpenClaw
brew "cc-switch-cli"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Copy files from your terminal that actually paste into GUI apps
brew "clippy"
# Console Matrix
brew "cmatrix"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Powerful, lightweight programming language
brew "lua"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Fast recursive search used throughout the shell workflow
brew "ripgrep"
# Tool to report network interface bandwidth
brew "ifstat"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Hyper-extensible modal text editor
brew "neovim"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Control and observe media playback from the command-line
brew "media-control"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Terminal-based visual file manager
brew "midnight-commander"
# Deep clean and optimize your Mac
brew "mole"
# Media player based on MPlayer and mplayer2
brew "mpv"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Single-player roguelike video game
brew "nethack"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# Ncurses based sudoku game
brew "nudoku"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Development kit for the Java programming language
brew "openjdk@17"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Command-line toolbox for fancy output in the terminal
brew "rich-cli"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# SMART hard drive monitoring
brew "smartmontools"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Manipulate and query tags on macOS files
brew "tag"
# User interface to the TELNET protocol
brew "telnet"
# Terminal image and video viewer
brew "timg"
# Lightweight BitTorrent client
brew "transmission-cli"
# Digital clock in ncurses
brew "tty-clock"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Image processing library
brew "vips"
# Terminal-based Tetris clone
brew "vitetris"
# Pager/text based browser
brew "w3m"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# File system for accessing archives using libarchive
brew "gromgit/fuse/archivemount-mac"
# Terminal-native coding agent for DeepSeek V4
brew "hmbown/deepseek-tui/deepseek-tui"
# An ncurses-based minesweeper game
brew "joelekstrom/repo/terminal-mines"
# Real-time power consumption monitor for Apple Silicon Macs
brew "k06a/tap/macpow"
# macOS Input Source Manager
brew "laishulu/homebrew/macism"
# Coordinates SketchyBar and the native macOS menu bar
brew "malpern/tap/sketchybar-toggle", trusted: true
# A tool for managing macOS Time Machine exclusions for developer projects
brew "mdnmdn/asimeow/asimeow", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Raycast launcher and Hyper key provider
cask "raycast"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tools for building Android applications
cask "android-studio"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Desktop password and login vault
cask "bitwarden"
# Monitors common persistence locations
cask "blockblock"
# Configuration manager for AI coding agents
cask "cc-switch"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Continuation of Clash Verge - A Clash Meta GUI based on Tauri
cask "clash-verge-rev"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Screen capturing tool
cask "cleanshot"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Disk space visualiser
cask "daisydisk"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Downloads videos from different websites
cask "downie"
# Run Stable Diffusion locally
cask "draw-things"
# Email client
cask "emclient"
# Flip clock screensaver
cask "fliqlo"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-hack-nerd-font"
cask "font-jetbrains-maple-mono-nf"
cask "laishulu/homebrew/font-sarasa-nerd"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# File synchronisation and backup software
cask "goodsync"
# Desktop automation application
cask "hammerspoon"
# Typeless input method companion
cask "typeless"
# Chromium-based browser with workspace support
cask "zen"
# Windows manager and desktop organiser
cask "hazeover"
# Chromium-based web browser
cask "helium-browser"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# System monitoring app
cask "istat-menus"
# Keyboard customiser
cask "karabiner-elements"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# AI-powered productivity tool for the command-line
cask "kiro-cli"
# GPU-based terminal emulator
cask "kitty"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Lunar calendar for menu bar
cask "lunarbar"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Multi-platform web browser
cask "microsoft-edge"
# Neovim Client
cask "neovide-app"
# Cloud storage service platform
cask "nutstore"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Chinese music streaming application
cask "qqmusic"
# Better Finder alternative
cask "qspace-pro"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Traditional roguelike dungeon crawler with randomised levels, enemies and items
cask "shattered-pixel-dungeon"
# Sound and audio controller
cask "soundsource"
# Rime input method engine
cask "squirrel-app"
# Cleanup and system status tool
cask "tencent-lemon"
# Configurable document editor that supports Markdown
cask "typora"
# Menu bar utility for viewing and switching macOS Spaces
cask "gechr/tap/whichspace", trusted: true
# Photo viewer, image manager, image resiser and more
cask "xnviewmp"
# Multiplayer code editor
cask "zed"
cargo "pokeget"
npm "corepack"
npm "reasonix"
